---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.NoTypeParamsDefinedWarning
source: html/bdfe2f34-b502-1b60-c9cb-d89c3033ed8b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.NoTypeParamsDefinedWarning Property

The parameters of the default type have no values.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoTypeParamsDefinedWarning { get; }
```